Juan/dropletTemplate/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            patch;
        nFaces          161;
        startFace       51520;
    }
    bottom
    {
        type            patch;
        nFaces          161;
        startFace       51681;
    }
    sideRight
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          161;
        startFace       51842;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sideLeft;
    }
    sideLeft
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          161;
        startFace       52003;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  sideRight;
    }
    frontback
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          51842;
        startFace       52164;
    }
)

// ************************************************************************* //
